In [167]:
%matplotlib inline
import pandas as pd
import numpy as np

In [168]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

In [169]:
titles = pd.DataFrame.from_csv('data/titles.csv', index_col=None)
titles.head()

                                           title  year
0                I Saw Mommy Kissing Santa Claus  2002
1  Bikini-Blitzkrieg, Part One: Dance Domination  2006
2                                Kirk kulok siri  1992
3  The Story of Jonah and the Whale (Sort of...)  2010
4                           Church of Redemption  2015

In [170]:
cast = pd.DataFrame.from_csv('data/cast.csv', index_col=None)
cast.head()

                               title  year       name   type character   n
0                    Suuri illusioni  1985     Homo $  actor    Guests  22
1     Gangsta Rap: The Glockumentary  2007  Too $hort  actor   Himself NaN
2                  Menace II Society  1993  Too $hort  actor   Lew-Loc  27
3  Porndogs: The Adventures of Sadie  2009  Too $hort  actor     Bosco   3
4                 Stop Pepper Palmer  2014  Too $hort  actor   Himself NaN

In [171]:
rd = pd.DataFrame.from_csv('data/release_dates.csv', index_col=None)
rd.head()

                           title  year      country        date
0          #73, Shaanthi Nivaasa  2007        India  2007-06-15
1  #AnonOccupy: Bio of a Villain  2015          USA  2015-11-05
2                        #Beings  2015      Romania  2015-01-29
3         #Ewankosau saranghaeyo  2015  Philippines  2015-01-21
4                        #Horror  2015          USA  2015-11-20

### How many movies are listed in the titles dataframe?

In [172]:
len(titles),len(cast),len(rd)

(218513, 3376362, 416220)

### What are the earliest two films listed in the titles dataframe?

In [173]:
titles.sort('year').head(2)

                                                    title  year
125920                                         Miss Jerry  1894
144439  Reproduction of the Corbett and Fitzsimmons Fight  1897

### How many movies have the title "Hamlet"?

In [174]:
len(titles[titles.title=='Hamlet'])

19

### How many movies are titled "North by Northwest"?

In [175]:
len(titles[titles.title=='North by Northwest'])

1

### When was the first movie titled "Hamlet" made?

In [176]:
titles[titles.title=='Hamlet'].sort('year').head(1)

         title  year
119586  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [177]:
titles[titles.title=='Treasure Island'].sort('year')

                  title  year
66440   Treasure Island  1918
192157  Treasure Island  1920
177062  Treasure Island  1934
197549  Treasure Island  1950
46401   Treasure Island  1972
205656  Treasure Island  1973
66191   Treasure Island  1985
57158   Treasure Island  1999

### How many movies were made in the year 1950?

In [178]:
len(titles[titles.year==1950])

1039

### How many movies were made in the year 1960?

In [179]:
len(titles[titles.year==1960])

1472

### How many movies were made from 1950 through 1959?

In [180]:
for year in range(1950,1960):
    print year,len(titles[titles.year == year])

1950 1039
1951 1105
1952 1089
1953 1137
1954 1169
1955 1188
1956 1255
1957 1362
1958 1425
1959 1397

### In what years has a movie titled "Batman" been released?

In [181]:
titles[titles.title == "Batman"]

         title  year
52664   Batman  1989
105850  Batman  1943

In [182]:
rd[rd.title == "Batman"]

        title  year         country        date
33104  Batman  1943             USA  1943-07-16
33105  Batman  1943          Mexico  1946-11-01
33106  Batman  1943        Portugal  1950-05-29
33107  Batman  1943    West Germany  1966-06-19
33108  Batman  1989             USA  1989-06-23
33109  Batman  1989         Ireland  1989-08-11
33110  Batman  1989              UK  1989-08-11
33111  Batman  1989       Australia  1989-08-31
33112  Batman  1989         Belgium  1989-09-13
33113  Batman  1989          France  1989-09-13
33114  Batman  1989         Denmark  1989-09-29
33115  Batman  1989     Netherlands  1989-09-29
33116  Batman  1989        Portugal  1989-09-29
33117  Batman  1989           Spain  1989-09-29
33118  Batman  1989          Taiwan  1989-10-07
33119  Batman  1989         Finland  1989-10-20
33120  Batman  1989           Italy  1989-10-20
33121  Batman  1989          Sweden  1989-10-20
33122  Batman  1989          Brazil  1989-10-26
33123  Batman  1989    West Germany  1989-10-26
33124  Batman  1989          Greece  1989-10-27
33125  Batman  1989       Hong Kong  1989-11-02
33126  Batman  1989      Yugoslavia  1989-11-21
33127  Batman  1989        Colombia  1989-11-23
33128  Batman  1989       Argentina  1989-12-14
33129  Batman  1989         Hungary  1989-12-21
33130  Batman  1989           Japan  1989-12-23
33131  Batman  1989          Poland  1989-12-31
33132  Batman  1989           India  1990-03-13
33133  Batman  1989     South Korea  1990-07-07
33134  Batman  1989  Czechoslovakia  1992-05-01

### How many roles were there in the movie "Inception"?

In [183]:
len(cast[cast.title=='Inception'])

74

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [184]:
lst = cast[cast.title=='Inception']
len(lst[lst.n.isnull()])

23

### But how many roles in the movie "Inception" did receive an "n" value?

In [185]:
len(lst[lst.n.notnull()])

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [186]:
lst = cast[cast.title=='North by Northwest']
lst = lst[lst.n.notnull()]
lst.sort('n')

,title,year,name,type,character,n
787455,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1
3144258,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2
1316346,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3
2829508,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4
321231,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5
2736177,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6
1532294,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7
1151433,North by Northwest,1959,Martin Landau,actor,Leonard,8
2208479,North by Northwest,1959,Adam Williams,actor,Valerian,9
1636454,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10
601387,North by Northwest,1959,Robert Ellenstein,actor,Licht,11
2071688,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12
418788,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13
1363428,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14
184495,North by Northwest,1959,Edward Binns,actor,Captain Junket,15
1250762,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [207]:
def cast_rank(title,year):
    lst = cast[(cast.title==title) & (cast.year==year)]
    return lst[lst.n.notnull()].sort('n')
cast_rank('Sleuth',1972)

,title,year,name,type,character,n
1541290,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1
293974,Sleuth,1972,Michael Caine,actor,Milo Tindle,2
336868,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3
1323759,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4
2452307,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5
1308800,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [208]:
cast_rank('Sleuth',2007)

          title  year           name   type    character  n
293975   Sleuth  2007  Michael Caine  actor       Andrew  1
1168222  Sleuth  2007       Jude Law  actor         Milo  2
1631576  Sleuth  2007  Harold Pinter  actor  Man on T.V.  3

### How many roles were credited in the silent 1921 version of Hamlet?

In [210]:
c = cast
c = c[(c.title == 'Hamlet') & (c.year == 1921)]
len(c)

9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [211]:
c = cast
c = c[(c.title == 'Hamlet') & (c.year == 1996)]
len(c)

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [191]:
len(cast[cast.character=='Hamlet'])

84

### How many people have played an "Ophelia"?

In [192]:
len(cast[cast.character=='Ophelia'])

98

### How many people have played a role called "The Dude"?

In [193]:
len(cast[cast.character=='The Dude'])

16

### How many people have played a role called "The Stranger"?

In [212]:
c = cast[cast.character=='The Stranger']
len(c)

195

### How many roles has Sidney Poitier played throughout his career?

In [195]:
len(cast[cast.name=='Sidney Poitier'])

43

### How many roles has Judi Dench played?

In [196]:
len(cast[cast.name=='Judi Dench'])

51

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [197]:
c = cast
c[(c.name=='Cary Grant') & (c.n==2) & (c.year>=1940) & (c.year < 1950)]

                   title  year        name   type    character  n
787452  My Favorite Wife  1940  Cary Grant  actor         Nick  2
787462    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [198]:
c = cast
c[(c.name=='Cary Grant') & (c.n==1) & (c.year>=1940) & (c.year < 1950)].sort('year')

,title,year,name,type,character,n
787477,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1
787434,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1
787479,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1
787467,Suspicion,1941,Cary Grant,actor,Johnnie,1
787481,The Talk of the Town,1942,Cary Grant,actor,Leopold Dilg,1
787458,Once Upon a Honeymoon,1942,Cary Grant,actor,Patrick 'Pat' O'Toole,1
787425,Destination Tokyo,1943,Cary Grant,actor,Capt. Cassidy,1
787450,Mr. Lucky,1943,Cary Grant,actor,Joe Adams,1
787451,Mr. Lucky,1943,Cary Grant,actor,Joe Bascopolous,1
787459,Once Upon a Time,1944,Cary Grant,actor,Jerry Flynn,1
787417,Arsenic and Old Lace,1944,Cary Grant,actor,Mortimer Brewster,1
787454,None But the Lonely Heart,1944,Cary Grant,actor,Ernie Mott,1
787453,Night and Day,1946,Cary Grant,actor,Cole Porter,1
787456,Notorious,1946,Cary Grant,actor,Devlin,1
787473,The Bachelor and the Bobby-Soxer,1947,Cary Grant,actor,Dick Nugent,1
787474,The Bishop's Wife,1947,Cary Grant,actor,Dudley,1
787449,Mr. Blandings Builds His Dream House,1948,Cary Grant,actor,Jim Blandings,1
787429,Every Girl Should Be Married,1948,Cary Grant,actor,Dr. Madison Brown,1
787438,I Was a Male War Bride,1949,Cary Grant,actor,Capt. Henri Rochard,1

### How many roles were available for actors in the 1950s?

In [199]:
c=cast
len(c[(c.year>=1950) & (c.year<1960) & (c.type=='actor')])

149755

### How many roles were avilable for actresses in the 1950s?

In [200]:
c=cast
len(c[(c.year>=1950) & (c.year<1960) & (c.type=='actress')])

54495

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [201]:
c = cast
c = c[c.year <= 1980]
c = c[c.n == 1]
len(c)

61876

### How many non-leading roles were available through from the beginning of film history through 1980?

In [202]:
c = cast
c = c[c.year <= 1980]
c = c[c.n != 1]
len(c)

1059254

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [203]:
c=cast
c = c[(c.year <= 1980)]
c = c[(c.n.isnull())]
len(c)

421393

In [204]:
h=titles.head()
h['year']

0    2002
1    2006
2    1992
3    2010
4    2015
Name: year, dtype: int64

In [205]:
h.year > 2000

0     True
1     True
2    False
3     True
4     True
Name: year, dtype: bool

In [206]:
h[h.year > 2000]

                                           title  year
0                I Saw Mommy Kissing Santa Claus  2002
1  Bikini-Blitzkrieg, Part One: Dance Domination  2006
3  The Story of Jonah and the Whale (Sort of...)  2010
4                           Church of Redemption  2015